package com.pieceofcakebot.pricing;

import lombok.experimental.UtilityClass;

@UtilityClass
public class Pricing {

    public String IndividualPricing = """
            16$/ 60хв - з будь яким з викладачів
                                      25$/ 60хв - з Native speaker
                                      35$/60 хв - з одним з власників школи
            """;
    public String AdultsLightPackage = """
            85$/міс або 295$/ увесь курс (5 місяців) - под стоимостью кнопка:
            Що входить?
               - 12 уроків на місяць/ 80 хв
                  груповий чат з наставником
                  онлайн підручник
                   участь у розіграші NCP
            """;

    public String AdultsFavouritePackage = """
            100$/міс або 375$/ увесь курс (5 місяців)
                                 Що входить?
               - 12 уроків на місяць/ 80 хв
                  груповий чат з наставником
                  онлайн підручник
                   участь у розіграші NCP
                  сучасна онлайн платформа з доступом 24/7
                  відпрацювання пропущених уроків
                  2 спікінг клаби з Native speaker
            """;

    public String AdultsDeliciousPackage = """
            85$/місяць або 720$/увесь курс (9 місяців)
                                        Що входить?
               - 8 уроків на місяць/ 50 хв
                  груповий чат з наставником
                  онлайн підручник
                   участь у розіграші NCP
                  сучасна онлайн платформа з доступом 24/7
                  відпрацювання пропущених уроків
                  4 спікінг клаби з Native speaker
                 заморозка занять
            """;
    public String TeenLightPackage = """
            70$/міс або 535$/ увесь курс (9 місяців) - под стоимостью кнопка:
            Що входить?
               - 8 уроків на місяць/ 60 хв
                  груповий чат з наставником
                  онлайн підручник
                   участь у розіграші NCP
                  сучасна онлайн платформа з доступом 24/7
            """;

    public String TeenFavouritePackage = """
            85$/міс або 695$/ увесь курс (9 місяців)
                              Що входить?
               - 8 уроків на місяць/ 60 хв
                  груповий чат з наставником
                  онлайн підручник
                   участь у розіграші NCP
                  сучасна онлайн платформа з доступом 24/7
                  відпрацювання пропущених уроків
                  2 спікінг клаби з Native speaker
            """;

    public String TeenDeliciousPackage = """
            100$/місяць або 825$/увесь курс (9 місяців)
                                        Що входить?
               - 8 уроків на місяць/ 60 хв
                  груповий чат з наставником
                  онлайн підручник
                   участь у розіграші NCP
                  сучасна онлайн платформа з доступом 24/7
                  відпрацювання пропущених уроків
                  4 спікінг клаби з Native speaker
                 заморозка занять
            """;
    public String ChildrenLightPackage = """
            55$/міс або 465$/ увесь курс (9 місяців) - под стоимостью кнопка:
            Що входить?
               - 8 уроків на місяць/ 50 хв
                  груповий чат з наставником
                  онлайн підручник
                   участь у розіграші NCP
                  сучасна онлайн платформа з доступом 24/7
            """;
    public String ChildrenFavouritePackage = """
            70$/міс або 635$/ увесь курс (9 місяців)
                               Що входить?
               - 8 уроків на місяць/ 50 хв
                  груповий чат з наставником
                  онлайн підручник
                   участь у розіграші NCP
                  сучасна онлайн платформа з доступом 24/7
                  відпрацювання пропущених уроків
                  2 спікінг клаби з Native speaker
            """;

    public String ChildrenDeliciousPackage = """
            5$/місяць або 720$/увесь курс (9 місяців)
                                        Що входить?
               - 8 уроків на місяць/ 50 хв
                  груповий чат з наставником
                  онлайн підручник
                   участь у розіграші NCP
                  сучасна онлайн платформа з доступом 24/7
                  відпрацювання пропущених уроків
                  4 спікінг клаби з Native speaker
                 заморозка занять
            """;
}
